package org.example; // декларация пакета, в котором находится класс

public class Main { // декларация класса с именем Main, здесь начинается тело класса

    // это однострочный комментарий для вставки текста, не являющегося кодом
    /* <--- начало многострочного комментария
        это многострочный комментарий для вставки текста, не являющегося кодом
    конец многострочного комментария ---> */

    //объявление метода main - запускающей точки приложения
    public static void main(String[] args) { // здесь открывается (начинается) тело метода
        // внутри метода располагается код приложения, который выполняет полезную алгоритмическую нагрузку
        System.out.println("Hello, I'm first Java app!!"); //эта команда (вызов функции) печатает в консоль строку
    } //здесь закрывается (заканчивается) тело метода
} // здесь заканчивается (закрывается) тело класса